DQN(
  (fc1): Linear(in_features=42, out_features=64, bias=True)
  (relu): ReLU()
  (fc2): Linear(in_features=64, out_features=64, bias=True)
  (fc3): Linear(in_features=64, out_features=7, bias=True)
)
Epsilon: 0.5
Results: [(1000, 0.701, 0.763), (2000, 0.757, 0.661), (3000, 0.754, 0.649), (4000, 0.846, 0.78), (5000, 0.805, 0.701), (6000, 0.746, 0.667), (7000, 0.777, 0.716), (8000, 0.811, 0.745), (9000, 0.84, 0.754), (10000, 0.836, 0.808), (11000, 0.882, 0.814), (12000, 0.84, 0.817), (13000, 0.858, 0.807), (14000, 0.867, 0.772), (15000, 0.856, 0.801), (16000, 0.853, 0.775), (17000, 0.843, 0.782), (18000, 0.864, 0.765), (19000, 0.846, 0.786), (20000, 0.889, 0.764)]