DQN(
  (fc1): Linear(in_features=42, out_features=64, bias=True)
  (relu): ReLU()
  (fc2): Linear(in_features=64, out_features=64, bias=True)
  (fc3): Linear(in_features=64, out_features=7, bias=True)
)
Epsilon: 0.5
Results: [(0, 0.643, 0.554), (1000, 0.802, 0.76), (2000, 0.783, 0.726), (3000, 0.749, 0.679), (4000, 0.791, 0.694), (5000, 0.848, 0.73), (6000, 0.773, 0.662), (7000, 0.831, 0.737), (8000, 0.82, 0.745), (9000, 0.835, 0.778)]